In [4]:
import pandas as pd

In [5]:
serie = pd.Series([11,22,33,44,55])
print(serie)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [6]:
serie.name = "roll"
print(serie)

0    11
1    22
2    33
3    44
4    55
Name: roll, dtype: int64

Same as previous indexing  dataset[start:end:step]

In [7]:
print(serie[0:5:2])

0    11
2    33
4    55
Name: roll, dtype: int64

One more thing Location based indexing ( .iloc[])

In [8]:
serie.iloc[3]

np.int64(44)

In [9]:
serie.iloc[[1,3]]

1    22
3    44
Name: roll, dtype: int64

change the lebels

In [10]:
l = ["barun", "ashok", "nikhil", "rahim", "kundu"]

In [11]:
serie.index = l
print(serie)

barun     11
ashok     22
nikhil    33
rahim     44
kundu     55
Name: roll, dtype: int64

index nameing

In [12]:
serie.name = "roll"
print(serie)

barun     11
ashok     22
nikhil    33
rahim     44
kundu     55
Name: roll, dtype: int64

Use new index try to access the value.

In [13]:
serie["barun"]
serie.loc["barun"]

np.int64(11)

In [14]:
serie.loc["barun": "nikhil"]

barun     11
ashok     22
nikhil    33
Name: roll, dtype: int64

In [15]:
serie.loc[["barun", "nikhil"]]

barun     11
nikhil    33
Name: roll, dtype: int64

How to create a series using dictionary

In [16]:
roll_number = {"rahim" : 11.0,
               "karim" : 22,
               "jodu" : 33,
               "modu" : 44,
               "kodu" : 55}

In [17]:
serie2 = pd.Series(roll_number, name="roll")
print(serie2)

rahim    11.0
karim    22.0
jodu     33.0
modu     44.0
kodu     55.0
Name: roll, dtype: float64

Need to find person who's roll number is less than 33

Conditional selection

In [18]:
serie2>=33

rahim    False
karim    False
jodu      True
modu      True
kodu      True
Name: roll, dtype: bool

but need to see only that values who satisfy the condition

In [19]:
serie2[serie2>=33]

jodu    33.0
modu    44.0
kodu    55.0
Name: roll, dtype: float64

Logical Operation

In [21]:
[(serie2>22 )& (serie2<55)]

[rahim    False
 karim    False
 jodu      True
 modu      True
 kodu     False
 Name: roll, dtype: bool]

In [22]:
serie2[(serie2>22 )& (serie2<55)]

jodu    33.0
modu    44.0
Name: roll, dtype: float64

In [23]:
serie2[(serie2>22 ) | (serie2<55)]

rahim    11.0
karim    22.0
jodu     33.0
modu     44.0
kodu     55.0
Name: roll, dtype: float64

In [24]:
serie2[~(serie2>33)]

rahim    11.0
karim    22.0
jodu     33.0
Name: roll, dtype: float64

modifying the labels number

In [25]:
serie2.loc["karim"] = 99
print(serie2)

rahim    11.0
karim    99.0
jodu     33.0
modu     44.0
kodu     55.0
Name: roll, dtype: float64

In [26]:
import numpy as np

In [27]:
ser = pd.Series(["a", 1, np.nan, np.nan, 2 ])
ser.notnull.sum()

AttributeError: 'function' object has no attribute 'sum'

Data frame

In [28]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, "np.nan", 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, "np.nan", 50000]
  }

convert into data frame

In [29]:
df = pd.DataFrame(data)
print(df)

      Name     Age Department  Salary
0    Alice      25         HR   50000
1      Bob      30         IT   60000
2  Charlie      35    Finance   70000
3    David  np.nan         IT   62000
4      Eve      29         HR  np.nan
5    Alice      25         HR   50000

In [37]:
df["Salary"]

0     50000
1     60000
2     70000
3     62000
4    np.nan
5     50000
Name: Salary, dtype: object

select some specific variable data

In [44]:
df.loc[1:3, ["Name","Age", "Salary"]]

      Name     Age Salary
1      Bob      30  60000
2  Charlie      35  70000
3    David  np.nan  62000

In [34]:
df.head(1) #in the top how many numbers we need to see

    Name Age Department Salary
0  Alice  25         HR  50000

In [36]:
df.tail(1) # show last numbers

    Name Age Department Salary
5  Alice  25         HR  50000

.loc Or .iloc function use

In [ ]:
df